local lua_values = 
 { 
    id = {1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,},
    x = {14,14,14,13,12,11,10,5,2,14,13,12,11,10,5,2,14,12,11,10,9,9,8,6,6,4,2,2,1,14,12,11,10,9,9,8,6,6,4,2,2,1,14,9,3,6,14,9,3,6,14,14,13,12,10,10,9,8,8,7,7,6,5,5,4,3,1,1,1,6,2,7,1,10,1,14,3,1,12,12,13,7,7,1,12,10,9,12,9,3,10,5,3,14,7,5,5,14,12,3,4,6,4,10,1,8,11,10,11,},
    y = {16,16,13,10,13,18,15,5,7,13,10,13,18,15,5,7,8,5,9,7,6,18,14,9,14,9,8,12,17,8,5,9,7,6,18,14,9,14,9,8,12,17,3,4,5,19,3,4,5,19,1,2,8,4,5,13,17,4,13,9,20,16,4,20,14,6,9,13,18,20,5,5,11,3,14,15,19,7,2,15,2,12,4,10,9,9,10,7,15,8,18,13,12,4,18,18,9,12,6,16,4,17,16,4,16,16,7,10,13,},
    icon = {'0','0','ins_monster_01','ins_monster_01','ins_monster_01','ins_monster_01','ins_monster_01','ins_monster_01','ins_monster_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_monster_02','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_monster_03','ins_monster_03','ins_monster_03','ins_monster_03','ins_relics_01','ins_relics_01','ins_relics_01','ins_relics_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_01','ins_case_02','ins_case_02','ins_case_02','ins_case_02','ins_barracks_01','ins_barracks_01','ins_fountain_01','ins_fountain_01','ins_resurrection_01','ins_resurrection_01','ins_clue_01','ins_sun_console_03','ins_sun_console_01','ins_sun_console_04','ins_sun_console_02','ins_sun_decline_03','ins_sun_decline_03','ins_sun_decline_03','ins_moon_decline_03','ins_moon_decline_03','ins_moon_decline_03','ins_sun_decline_01','ins_sun_decline_01','ins_sun_decline_01','ins_moon_decline_01','ins_moon_decline_01','ins_moon_decline_01','ins_moon_decline_01','ins_sun_decline_04','ins_sun_decline_04','ins_sun_decline_04','ins_moon_decline_04','ins_moon_decline_04','ins_moon_decline_04','ins_sun_decline_02','ins_sun_decline_02','ins_sun_decline_02','ins_moon_decline_02','ins_moon_decline_02','ins_moon_decline_02',},
    changeicon = {'0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','ins_moon_console_03','ins_moon_console_01','ins_moon_console_04','ins_moon_console_02','ins_sun_rise_03','ins_sun_rise_03','ins_sun_rise_03','ins_moon_rise_03','ins_moon_rise_03','ins_moon_rise_03','ins_sun_rise_01','ins_sun_rise_01','ins_sun_rise_01','ins_moon_rise_01','ins_moon_rise_01','ins_moon_rise_01','ins_moon_rise_01','ins_sun_rise_04','ins_sun_rise_04','ins_sun_rise_04','ins_moon_rise_04','ins_moon_rise_04','ins_moon_rise_04','ins_sun_rise_02','ins_sun_rise_02','ins_sun_rise_02','ins_moon_rise_02','ins_moon_rise_02','ins_moon_rise_02',},
    name = {'0','剧情','敌人','敌人','敌人','敌人','敌人','敌人','敌人','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','精锐敌人','精锐敌人','精锐敌人','精锐敌人','精锐敌人','精锐敌人','精锐敌人','精锐敌人','精锐敌人','精锐敌人','精锐敌人','精锐敌人','精锐敌人','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','选择遗物','首领级敌人','首领级敌人','首领级敌人','首领级敌人','选择遗物','选择遗物','选择遗物','选择遗物','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','普通宝箱','高级宝箱','高级宝箱','高级宝箱','高级宝箱','佣兵营地','佣兵营地','魔法泉水','魔法泉水','复苏祭坛','复苏祭坛','线索','蓝控制台','红控制台','黄控制台','绿控制台','蓝太阳','蓝太阳','蓝太阳','蓝月亮','蓝月亮','蓝月亮','红太阳','红太阳','红太阳','红月亮','红月亮','红月亮','红月亮','黄太阳','黄太阳','黄太阳','黄月亮','黄月亮','黄月亮','绿太阳','绿太阳','绿太阳','绿月亮','绿月亮','绿月亮',},
    type = {1,2,3,3,3,3,3,3,3,8,8,8,8,8,8,8,4,4,4,4,4,4,4,4,4,4,4,4,4,8,8,8,8,8,8,8,8,8,8,8,8,8,5,5,5,5,8,8,8,8,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,7,7,7,7,9,9,10,10,11,11,12,20,20,20,20,100,100,100,101,101,101,100,100,100,101,101,101,101,100,100,100,101,101,101,100,100,100,101,101,101,},
    initialtype = {0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,2,0,0,0,0,0,0,0,0,0,0,0,0,0,2,2,2,2,2,2,2,2,2,2,2,2,2,0,0,0,0,2,2,2,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
    initial = {'0','0','0','0','0','0','0','0','0','3','4','5','6','7','8','9','0','0','0','0','0','0','0','0','0','0','0','0','0','17','18','19','20','21','22','23','24','25','26','27','28','29','0','0','0','0','43','44','45','46','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0',},
    delayed = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
    trigger = {0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
    passby = {0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
    show = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,},
    event = {0,0,400901,400902,400903,400904,400905,400906,400907,1,1,1,1,1,1,1,400908,400909,400910,400911,400912,400913,400914,400915,400916,400917,400918,400919,400920,2,2,2,2,2,2,2,2,2,2,2,2,2,400921,400922,400923,400924,3,3,3,3,1009101,1009102,1009103,1009104,1009105,1009106,1009107,1009108,1009109,1009110,1009111,1009112,1009113,1009114,1009115,1009116,1009117,1009118,1009119,1009201,1009202,1009203,1009204,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,1,1,0,0,0,1,1,1,1,0,0,0,1,1,1,0,0,0,1,1,1,},
    priority = {1,2,1,1,1,1,1,1,1,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,2,2,1,1,1,1,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,},
    story = {0,901001,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
    journal = {'0','查看线索，解析谜题。','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','观察太阳与月亮，解除谜题。','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0',},
    tips = {'0','0','此处被一队实力普通的敌人占据。\n击败他们才能通过此处。','此处被一队实力普通的敌人占据。\n击败他们才能通过此处。','此处被一队实力普通的敌人占据。\n击败他们才能通过此处。','此处被一队实力普通的敌人占据。\n击败他们才能通过此处。','此处被一队实力普通的敌人占据。\n击败他们才能通过此处。','此处被一队实力普通的敌人占据。\n击败他们才能通过此处。','此处被一队实力普通的敌人占据。\n击败他们才能通过此处。','0','0','0','0','0','0','0','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','此处被一队实力强劲的敌人占据。\n击败他们才能通过此处。','0','0','0','0','0','0','0','0','0','0','0','0','0','此处被一队实力极其强大的敌人占据。\n击败他们才能通过此处。','此处被一队实力极其强大的敌人占据。\n击败他们才能通过此处。','此处被一队实力极其强大的敌人占据。\n击败他们才能通过此处。','此处被一队实力极其强大的敌人占据。\n击败他们才能通过此处。','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','邀请一位英雄，协助完成本次探索。','邀请一位英雄，协助完成本次探索。','聚集魔法能量的温泉，似乎可以缓解战斗带来的伤痛。','聚集魔法能量的温泉，似乎可以缓解战斗带来的伤痛。','神秘的祭坛，似乎有生命的法则环绕。','神秘的祭坛，似乎有生命的法则环绕。','当太阳升起的时候月亮将会落下；当太阳落下的时候月亮将会升起。','一个魔法机关，可以改变所有蓝色石柱的状态。','一个魔法机关，可以改变所有红色石柱的状态。','一个魔法机关，可以改变所有金色石柱的状态。','一个魔法机关，可以改变所有绿色石柱的状态。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“太阳”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“月亮”的图案。','一个地面升起的石柱，上面有“月亮”的图案。',},
    remarks = {'0','0','掉落稀有或精英级别的遗物','掉落稀有或精英级别的遗物','掉落稀有或精英级别的遗物','掉落稀有或精英级别的遗物','掉落稀有或精英级别的遗物','掉落稀有或精英级别的遗物','掉落稀有或精英级别的遗物','0','0','0','0','0','0','0','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','掉落精英或史诗级别的遗物','0','0','0','0','0','0','0','0','0','0','0','0','0','掉落史诗级别的遗物','掉落史诗级别的遗物','掉落史诗级别的遗物','掉落史诗级别的遗物','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','所有存活英雄恢复50%生命','所有存活英雄恢复50%生命','随机复活一名已经阵亡的英雄','随机复活一名已经阵亡的英雄','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0',},
    removetype = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
    removerelation = {'0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0',},
    remove = {'0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0',},
    establish = {'0','0','10','11','12','13','14','15','16','0','0','0','0','0','0','0','30','31','32','33','34','35','36','37','38','39','40','41','42','0','0','0','0','0','0','0','0','0','0','0','0','0','47','48','49','50','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0',},
    modify = {'0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','85|86|87|88|89|90','91|92|93|94|95|96|97','98|99|100|101|102|103','104|105|106|107|108|109','81','81','81','81','81','81','82','82','82','82','82','82','82','83','83','83','83','83','83','84','84','84','84','84','84',},
    dispel = {'0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','5|13','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0',},
    performance = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,90101,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
    setup = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
}; 

local lua_idkey = 
 { 
    [1] = 1,
    [2] = 2,
    [3] = 3,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
    [77] = 77,
    [78] = 78,
    [79] = 79,
    [80] = 80,
    [81] = 81,
    [82] = 82,
    [83] = 83,
    [84] = 84,
    [85] = 85,
    [86] = 86,
    [87] = 87,
    [88] = 88,
    [89] = 89,
    [90] = 90,
    [91] = 91,
    [92] = 92,
    [93] = 93,
    [94] = 94,
    [95] = 95,
    [96] = 96,
    [97] = 97,
    [98] = 98,
    [99] = 99,
    [100] = 100,
    [101] = 101,
    [102] = 102,
    [103] = 103,
    [104] = 104,
    [105] = 105,
    [106] = 106,
    [107] = 107,
    [108] = 108,
    [109] = 109,
};

local LuaData = {lua_values = lua_values,lua_idkey = lua_idkey};

function LuaData.GetIds() 
    return {1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,};
end

function LuaData.GetKeys() 
    return {'id','x','y','icon','changeicon','name','type','initialtype','initial','delayed','trigger','passby','show','event','priority','story','journal','tips','remarks','removetype','removerelation','remove','establish','modify','dispel','performance','setup',};
end

function LuaData.GetIndex(id) 
   local index = lua_idkey[id];
   if (index == nil) then
       return nil;
   end
   return index
end

function LuaData.GetValueTable(id) 
    if (id == nil) then 
        return nil;
    end
    local index = lua_idkey[id];
    if (index == nil) then
        return nil;
    end
    return {id = lua_values.id[index], x = lua_values.x[index], y = lua_values.y[index], icon = lua_values.icon[index], changeicon = lua_values.changeicon[index], name = lua_values.name[index], type = lua_values.type[index], initialtype = lua_values.initialtype[index], initial = lua_values.initial[index], delayed = lua_values.delayed[index], trigger = lua_values.trigger[index], passby = lua_values.passby[index], show = lua_values.show[index], event = lua_values.event[index], priority = lua_values.priority[index], story = lua_values.story[index], journal = lua_values.journal[index], tips = lua_values.tips[index], remarks = lua_values.remarks[index], removetype = lua_values.removetype[index], removerelation = lua_values.removerelation[index], remove = lua_values.remove[index], establish = lua_values.establish[index], modify = lua_values.modify[index], dispel = lua_values.dispel[index], performance = lua_values.performance[index], setup = lua_values.setup[index], }
end

function LuaData.GetValue(id, key) 
   if (id == nil) then
       return nil;
   end
   local index = lua_idkey[id];
   if (index == nil) then
       return nil;
   end
   if (lua_values[key] == nil) then
       return nil;
   end
   return lua_values[key][index];
end

function LuaData.GetColValues(key)
   if (lua_values[key] == nil) then
       return nil;
   end
   return lua_values[key];
end

function LuaData.IsIdExist(id)
   if (id == nil) then
       return false;
   end
   local index = lua_idkey[id];
   if (index == nil) then
       return false;
   end
   return true;
end

function LuaData.IsKeyExist(key)
   if (lua_values[key] == nil) then
       return false;
   end
   return true;
end

return LuaData;